azure/repind-ri-ws/api/CreateOrUpdateIndividualWS/v8/Regression Tests/CreateUpdate Type W/Create.bru

meta {
  name: Create
  type: http
  seq: 1
}

post {
  url: {{create-or-update-individual-v8-url}}
  body: xml
  auth: none
}

headers {
  SOAPAction: "http://www.af-klm.com/services/passenger/CreateUpdateIndividualService-v8/createIndividual"
}

body:xml {
  <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
      <soapenv:Body>
          <ns5:CreateUpdateIndividualRequestElement xmlns:ns6="http://www.af-klm.com/services/passenger/response-v8/xsd"
              xmlns:ns5="http://www.af-klm.com/services/passenger/data-v8/xsd"
              xmlns:ns8="http://www.af-klm.com/services/passenger/SicOsirisType-v1/xsd"
              xmlns:ns7="http://www.af-klm.com/services/passenger/SicIndividuType-v3/xsd"
              xmlns:ns2="http://www.af-klm.com/services/passenger/SoftComputingType-v1/xsd"
              xmlns:ns4="http://www.af-klm.com/services/passenger/SicCommonType-v1/xsd"
              xmlns:ns3="http://www.af-klm.com/services/passenger/request-v8/xsd">
              <process>T</process>
              <requestor>
                  <channel>CBS</channel>
                  <site>QVI</site>
                  <signature>REGRESSION</signature>
              </requestor>
              <emailRequest>
                  <email>
                      <mediumStatus>V</mediumStatus>
                      <mediumCode>D</mediumCode>
                      <email>TOBE{{randomString}}@GHANGED.FR</email>
                  </email>
              </emailRequest>
              <individualRequest>
                  <individualInformations>
                      <gender>M</gender>
                      <status>V</status>
                      <civility>MR</civility>
                      <lastNameSC>MAGOO</lastNameSC>
                      <firstNameSC>MIRO</firstNameSC>
                  </individualInformations>
              </individualRequest>
          </ns5:CreateUpdateIndividualRequestElement>
      </soapenv:Body>
  </soapenv:Envelope>
}

vars:pre-request {
  USER: W90000442
  PASSWORD: pswpsw123
}

vars:post-response {
  gin_create: res.body.substring(res.body.indexOf('<gin>') + 5, res.body.indexOf('<gin>') + 5 + 12)
}

assert {
  res.status: eq 200
}
